package 控制结构;

public class if分支 {
}



/*

只运行true:

        if语句:
        格式:
        if(关系表达式) {
        语句体
        }

        1. 首先计算好关系表达式的值
        2. 如果关系表达式的  值  为true就执行语句体
        3. 如果关系表达式的  值   为false就不执行语句体
        4. 继续执行后面的语句

        if语句2;
        格式:
        if(关系表达式){
        语句体1;
        }else{
        语句体2;
        }

        1.首先计算关系表达式的值
        2.如果关系表达式的 值 为true就执行 语句体1
        3.如果关系表达式的 值  为false就执行 语句体2
        4. 继续执行后面的语句

        if语句3;
        格式:
        if (关系表达式1){
        语句体1;
        }else if (关系表达式2){
        语句体2;
        }
        ...
        else{
        语句体n+1;
        }
        1.首先计算关系表达式1的值

        2.如果 值 为true就执行语句体1;如果 值 为false就计算关系表达式2的值

        3.如果 值  为true就执行语句体1, 如果值为false就计算关系表达式3的值

        4...

        5.如果没有任何关系表达式为true,就执行语句体n+1.

              */
